Revit 2024 API
StripedRowPattern Enumeration
 An enumerated type representing the possible sets of rows of a striped row schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Since: 2021
Syntax
C#
public enum StripedRowPattern
Visual Basic
Public Enumeration StripedRowPattern
Visual C++
public enum class StripedRowPattern
Members
Member name | Description
FirstRow |  The first row and every other row thereafter.
SecondRow |  The second row and every other row thereafter.
See Also
Autodesk.Revit.DB Namespace